<?php
// +----------------------------------------------------------------------
// 最便捷的php框架
// +----------------------------------------------------------------------
// | Copyright (c) 2011 http://www.ky53.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.ky53.net )
// +----------------------------------------------------------------------

/**
 
 * @author   qq:974005652(zhx626@126.com) by老顽童
 * @version  2.0
 +------------------------------------------------------------------------------
 */
$_['notice']='通知';
$_['warning']='警告';
$_['fatal']='致命';
$_['unknow']='未知';
$_['error']='错误';
$_['error_no']='错误号';
$_['error_ky']='科亿报错';
$_['title']='最实用的PHP框架-KYPHP框架';
$_['error_info']='错误信息';
$_['file']='文件：';
$_['kyphp_web']='官方网站：';
$_['lineno']='第%s行';
$_['help']='帮助手册';
$_['version']='版本：v1.0 by 老顽童  联系';
$_['method']='方法';
$_['class']='类';
$_['noexist']='不存在';
$_['app_dirnoexist']='不存在<br>请指定app_dir<br>';
$_['path_key_model']="系统错误，请正确设置系统PATH_KEY模式";
return $_;
?>